{
    "header": {
        "title": "Vlad Kouzin",
        "subtitle": "$HEADER_SUBTITLE/Platform Engineer",
        "labels": [
            {
                "label": "vkouzin@outlook.com"
            }
        ],
        "links": [
            {
                "label": "linkedin.com/in/vkouzin",
                "url": "https://www.linkedin.com/in/vkouzin/"
            },
            {
                "label": "github.com/cufee",
                "url": "https://github.com/cufee"
            },
            {
                "label": "resume.kouzin.net",
                "url": "https://resume.kouzin.net"
            }
        ]
    },
    "content": {
        "summary": "Experienced software engineer with a passion for solving complex problems efficiently. Seeking a remote position to contribute to an innovative team focused on quality and growth.",
        "expandUrl": "https://linkedin.com/in/vkouzin/",
        "positions": [
            {
                "title": "$POSITION_TITLE_VD/Platform Engineer",
                "location": "Remote",
                "labels": [
                    {
                        "label": "byvko.dev"
                    }
                ],
                "technologies": [
                    "Go",
                    "React",
                    "CI/CD",
                    "Docker",
                    "$TECHNOLOGY_CLOUD_PRIMARY/GCP"
                ],
                "bullets": [
                    "Led the refactoring of a large codebase, consolidating over 7 microservices into a single, highly efficient application, improving overall system performance by 40%.",
                    "Migrated the database layer from MongoDB to SQLite, resulting in a 50% reduction in query latency and a more lightweight, easily maintainable storage solution.",
                    "Drove a 70% reduction in code duplication and technical debt through meticulous code refactoring and the implementation of best practices.",
                    "Improved system reliability and reduced bug incidence by 60%, ensuring a more stable and robust application architecture."
                ],
                "startedOn": "2023",
                "finishedOn": ""
            },
            {
                "title": "$POSITION_TITLE_AM/Platform Engineer",
                "location": "Austin, TX",
                "labels": [
                    {
                        "url": "https://www.alertmedia.com",
                        "label": "AlertMedia"
                    }
                ],
                "technologies": [
                    "$TECHNOLOGY_JS_RUNTIME/Node.js",
                    "$TECHNOLOGY_FE_LIBRARY/React",
                    "OpenAI",
                    "Terraform",
                    "$TECHNOLOGY_CLOUD_PRIMARY/AWS"
                ],
                "bullets": [
                    "Designed and developed multiple high-impact web applications for internal use by engineering and management teams, improving operational efficiency by 50%.",
                    "Built and deployed a suite of CLI tools that automated repetitive tasks, reducing manual effort by 80% and accelerating the developer onboarding process by 3x.",
                    "Streamlined Docker Compose configurations, establishing a scalable and maintainable framework that simplified the integration of new services and reduced setup time by 60%.",
                    "Led a comprehensive refactor of legacy code, slashing CI/CD pipeline run time from over an hour to just 7 minutes, dramatically enhancing development velocity and productivity."
                ],
                "startedOn": "2022",
                "finishedOn": "2023"
            },
            {
                "title": "$POSITION_TITLE_CP/Platform Engineer",
                "location": "Remote",
                "labels": [
                    {
                        "url": "https://www.chilipiper.com",
                        "label": "Chili Piper"
                    }
                ],
                "technologies": [
                    "Go",
                    "$TECHNOLOGY_JS_RUNTIME/Node.js",
                    "$TECHNOLOGY_FE_LIBRARY/React",
                    "Kubernetes",
                    "$TECHNOLOGY_CLOUD_PRIMARY/GCP"
                ],
                "bullets": [
                    "Engineered highly popular customer-facing tools and add-ons for Chili Piper, significantly expanding the platform's feature set and driving a 25% increase in user engagement.",
                    "Authored comprehensive documentation and developed \"magic\" scripts, streamlining the onboarding process for new customers, resulting in a 40% reduction in setup time.",
                    "Developed and launched an internal support portal, aggregating data from multiple sources to create a unified source of truth, empowering the Customer Success team with real-time insights.",
                    "Managed and optimized a Kubernetes cluster hosting all internal services and tools, ensuring 99.9% uptime and seamless scalability to meet growing operational demand."
                ],
                "startedOn": "2021",
                "finishedOn": "2022"
            },
            {
                "title": "$POSITION_TITLE_MS/Internal Tooling Engineer",
                "location": "Redmond, WA",
                "labels": [
                    {
                        "url": "https://killedbymicrosoft.info",
                        "label": "Mixer.com"
                    }
                ],
                "technologies": [
                    "JavaScript",
                    "Python"
                ],
                "bullets": [
                    "Developed custom tools and scripts, optimizing workflow organization and efficiency, leading to a 24% improvement in task completion speed.",
                    "Authored detailed documentation for troubleshooting hardware and software issues, reducing incident resolution time by 13%.",
                    "Managed and safeguarded highly confidential information, ensuring compliance with data security protocols."
                ],
                "startedOn": "2020",
                "finishedOn": "2021"
            }
        ]
    },
    "sidebar": {
        "skills": [
            [
                "Go",
                "Python",
                "TypeScript",
                "OpenAI"
            ],
            [
                "Node.js, Deno",
                "Express, Go Fiber",
                "React, Svelte, HTMX"
            ],
            [
                "Helm, Terraform",
                "Docker, Kubernetes",
                "AWS, GCP, DigitalOcean",
                "CircleCI, BitBucket, GitHub"
            ]
        ],
        "projects": [
            {
                "title": "Feedlr",
                "technologies": [
                    "Go",
                    "HTMX/templ"
                ],
                "labels": [
                    {
                        "label": "GitHub",
                        "url": "https://github.com/Cufee/feedlr-yt"
                    }
                ],
                "description": "Ad-free YouTube frontend alternative with build-in sponsor blocking and zero tracking."
            },
            {
                "title": "Aftermath",
                "technologies": [
                    "Go",
                    "React",
                    "HTMX"
                ],
                "labels": [
                    {
                        "label": "GitHub",
                        "url": "https://github.com/Cufee/aftermath"
                    }
                ],
                "description": "Highly rated Discord Bot for in-game progress tracking with a beautiful UI and a custom rendering engine."
            },
            {
                "title": "Pulley",
                "technologies": [
                    "TypeScript",
                    "Deno"
                ],
                "labels": [
                    {
                        "label": "GitHub"
                    }
                ],
                "description": "User-friendly CLI tool for fast git repository management."
            }
        ]
    }
}